espressif/arduino-esp32/boards.txt
##############################################################

firebeetle32.name=FireBeetle-ESP32

firebeetle32.upload.tool=esptool
firebeetle32.upload.maximum_size=1044464
firebeetle32.upload.maximum_data_size=294912
firebeetle32.upload.wait_for_upload_port=true

firebeetle32.serial.disableDTR=true
firebeetle32.serial.disableRTS=true

firebeetle32.build.mcu=esp32
firebeetle32.build.core=esp32
firebeetle32.build.variant=firebeetle32
firebeetle32.build.board=ESP32_DEV

firebeetle32.build.f_cpu=240000000L
firebeetle32.build.flash_mode=dio
firebeetle32.build.flash_size=4MB

firebeetle32.menu.FlashFreq.80=80MHz
firebeetle32.menu.FlashFreq.80.build.flash_freq=80m
firebeetle32.menu.FlashFreq.40=40MHz
firebeetle32.menu.FlashFreq.40.build.flash_freq=40m

firebeetle32.menu.UploadSpeed.921600=921600
firebeetle32.menu.UploadSpeed.921600.upload.speed=921600
firebeetle32.menu.UploadSpeed.115200=115200
firebeetle32.menu.UploadSpeed.115200.upload.speed=115200
firebeetle32.menu.UploadSpeed.256000.windows=256000
firebeetle32.menu.UploadSpeed.256000.upload.speed=256000
firebeetle32.menu.UploadSpeed.230400.windows.upload.speed=256000
firebeetle32.menu.UploadSpeed.230400=230400
firebeetle32.menu.UploadSpeed.230400.upload.speed=230400
firebeetle32.menu.UploadSpeed.460800.linux=460800
firebeetle32.menu.UploadSpeed.460800.macosx=460800
firebeetle32.menu.UploadSpeed.460800.upload.speed=460800
firebeetle32.menu.UploadSpeed.512000.windows=512000
firebeetle32.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

intorobot-fig.name=IntoRobot Fig

intorobot-fig.upload.tool=esptool
intorobot-fig.upload.maximum_size=1044464
intorobot-fig.upload.maximum_data_size=294912
intorobot-fig.upload.wait_for_upload_port=true

intorobot-fig.serial.disableDTR=true
intorobot-fig.serial.disableRTS=true

intorobot-fig.build.mcu=esp32
intorobot-fig.build.core=esp32
intorobot-fig.build.variant=intorobot-fig
intorobot-fig.build.board=INTOROBOT_ESP32_DEV

intorobot-fig.build.f_cpu=240000000L
intorobot-fig.build.flash_mode=dio
intorobot-fig.build.flash_size=4MB

intorobot-fig.menu.FlashFreq.80=80MHz
intorobot-fig.menu.FlashFreq.80.build.flash_freq=80m
intorobot-fig.menu.FlashFreq.40=40MHz
intorobot-fig.menu.FlashFreq.40.build.flash_freq=40m

intorobot-fig.menu.UploadSpeed.921600=921600
intorobot-fig.menu.UploadSpeed.921600.upload.speed=921600
intorobot-fig.menu.UploadSpeed.115200=115200
intorobot-fig.menu.UploadSpeed.115200.upload.speed=115200
intorobot-fig.menu.UploadSpeed.256000.windows=256000
intorobot-fig.menu.UploadSpeed.256000.upload.speed=256000
intorobot-fig.menu.UploadSpeed.230400.windows.upload.speed=256000
intorobot-fig.menu.UploadSpeed.230400=230400
intorobot-fig.menu.UploadSpeed.230400.upload.speed=230400
intorobot-fig.menu.UploadSpeed.460800.linux=460800
intorobot-fig.menu.UploadSpeed.460800.macosx=460800
intorobot-fig.menu.UploadSpeed.460800.upload.speed=460800
intorobot-fig.menu.UploadSpeed.512000.windows=512000
intorobot-fig.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

onehorse32dev.name=Onehorse ESP32 Dev Module

onehorse32dev.upload.tool=esptool
onehorse32dev.upload.maximum_size=1044464
onehorse32dev.upload.maximum_data_size=294912
onehorse32dev.upload.wait_for_upload_port=true

onehorse32dev.serial.disableDTR=true
onehorse32dev.serial.disableRTS=true

onehorse32dev.build.mcu=esp32
onehorse32dev.build.core=esp32
onehorse32dev.build.variant=onehorse32dev
onehorse32dev.build.board=ONEHORSE_ESP32_DEV

onehorse32dev.build.f_cpu=240000000L
onehorse32dev.build.flash_mode=dout
onehorse32dev.build.flash_size=4MB

onehorse32dev.menu.FlashFreq.80=80MHz
onehorse32dev.menu.FlashFreq.80.build.flash_freq=80m
onehorse32dev.menu.FlashFreq.40=40MHz
onehorse32dev.menu.FlashFreq.40.build.flash_freq=40m

onehorse32dev.menu.UploadSpeed.921600=921600
onehorse32dev.menu.UploadSpeed.921600.upload.speed=921600
onehorse32dev.menu.UploadSpeed.115200=115200
onehorse32dev.menu.UploadSpeed.115200.upload.speed=115200
onehorse32dev.menu.UploadSpeed.256000.windows=256000
onehorse32dev.menu.UploadSpeed.256000.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400.windows.upload.speed=256000
onehorse32dev.menu.UploadSpeed.230400=230400
onehorse32dev.menu.UploadSpeed.230400.upload.speed=230400
onehorse32dev.menu.UploadSpeed.460800.linux=460800
onehorse32dev.menu.UploadSpeed.460800.macosx=460800
onehorse32dev.menu.UploadSpeed.460800.upload.speed=460800
onehorse32dev.menu.UploadSpeed.512000.windows=512000
onehorse32dev.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

featheresp32.name=Adafruit ESP32 Feather

featheresp32.upload.tool=esptool
featheresp32.upload.maximum_size=1044464
featheresp32.upload.maximum_data_size=294912
featheresp32.upload.wait_for_upload_port=true

featheresp32.serial.disableDTR=true
featheresp32.serial.disableRTS=true

featheresp32.build.mcu=esp32
featheresp32.build.core=esp32
featheresp32.build.variant=feather_esp32
featheresp32.build.board=FEATHER_ESP32

featheresp32.build.f_cpu=240000000L
featheresp32.build.flash_mode=dio
featheresp32.build.flash_size=4MB

featheresp32.menu.FlashFreq.80=80MHz
featheresp32.menu.FlashFreq.80.build.flash_freq=80m
featheresp32.menu.FlashFreq.40=40MHz
featheresp32.menu.FlashFreq.40.build.flash_freq=40m

featheresp32.menu.UploadSpeed.921600=921600
featheresp32.menu.UploadSpeed.921600.upload.speed=921600
featheresp32.menu.UploadSpeed.115200=115200
featheresp32.menu.UploadSpeed.115200.upload.speed=115200
featheresp32.menu.UploadSpeed.256000.windows=256000
featheresp32.menu.UploadSpeed.256000.upload.speed=256000
featheresp32.menu.UploadSpeed.230400.windows.upload.speed=256000
featheresp32.menu.UploadSpeed.230400=230400
featheresp32.menu.UploadSpeed.230400.upload.speed=230400
featheresp32.menu.UploadSpeed.460800.linux=460800
featheresp32.menu.UploadSpeed.460800.macosx=460800
featheresp32.menu.UploadSpeed.460800.upload.speed=460800
featheresp32.menu.UploadSpeed.512000.windows=512000
featheresp32.menu.UploadSpeed.512000.upload.speed=512000

##############################################################